{
    "typWWW": "text",
    "naglowek": "Porady",
    "tresc": "Czy warto aktualizować oprogramowanie ?<br>Co to są aktualizacje oprogramowania ?<br><br>Aktualizacje oprogramowania to nic innego jak nowsze wersje aktualnie zainstalowanych aplikacji w naszym systemie operacyjnym, a także samego sytemu. Często bywa tak, że aktualizacja wykonywana jest automatycznie przez co nawet jej nie dostrzegamy lub nie zwracamy na nią uwagi gdyż wykonywana jest w tle nie przeszkadzając nam w aktualnie wykonywanej pracy na komputerze. Pomimo tego, iż może wydawać się, że aktualizacje niczego nie wnoszą do naszego komputera to jednak nie powinniśmy o nich zapominać i dbać o to aby nasz system operacyjny oraz oprogramowanie zainstalowane na komputerze było zawsze aktualne tzn. w najnowszych dostępnych wersjach. Faktycznie bywa, że dana aktualizacja nie wprowadza widocznych dla użytkownika zmian jednak nie jest wypuszczana prze firmy dostarczające oprogramowanie bez powodu.<br><br>Aktualizacje oprogramowania pełnią kilka bardzo ważnych ról, możemy zaliczyć do nich:<br><br>    &nbspudostępnienie dodatkowych opcji programu<br>    &nbspwyeliminowanie znanych błędów<br>    &nbspusunięcie luk w oprogramowaniu które mogą posłużyć włamaniu do naszego komputera<br>    &nbspodświeżenie interfejsu (wyglądu)<br>    &nbspoptymalizacja czyli poprawienie wydajności i szybkości działania.<br><br>Nieaktualne oprogramowanie i system operacyjny może być niebezpieczne<br><br>Zaniedbywanie regularnych aktualizacji oprogramowania i systemu operacyjnego komputera może okazać się destrukcyjne dla komputera. Cyberprzestępcy tylko czekają na nadarzenie się okazji umożliwiającej przypuszczenie ataku na źle zabepieczony komputer, bardzo często wykorzystują do tego celu luki w nieaktualnym systemie aktualizacja systemu windowsoperacyjnym lub oprogramowaniu w nim zainstalowanym. Luki takie mogą umożliwić hakerowi różnojakie działania, może to być wprowadzenie jakiegoś złośliwego oprogramowania, włamanie do naszego komputera bądź też inne mało przyjemne rzeczy.<br>Korzyści z regularnego aktualizowania aplikacji oraz systemu<br><br>Regularne aktualizowanie zainstalowanych aplikacji oraz systemu operacyjnego przynosi wymierne korzyści zapewniając nam maksymalny poziom bezpieczeństwa minimalizując ryzyko ataku hakera z wykorzystaniem luk w programach.  Aktualizacje przyczyniają się do poprawienia jakości pracy z programami po przez odpowiednią optymaliację i zwiększenie wydajności, a często także dostarczają dodatkowych opcji oraz możliwości danej aplikacji zwiększając w ten sposób jej funkcjonalność. <br>Popularne oprogramowanie które wymaga częstego aktualizowania<br><br>Częste aktualizacje możemy zaobserwować w samym systemie operacyjnym, to fundament bezpieczeństwa i prawidłowego działania każdego komputera. Systemy Windows posiadają wbudowany mechanizm automatycznych aktualizacji umożliwiającym ich automatyczne pobieranie i instalację, nie zapominajmy o ich prawidłowej konfiguracji aby mogły spełniać swoje zadanie. Kolejnym często aktualizowanym składnikiem jest program antywirusowy. W oprogramowaniu antywirusowym aktualizacja bazy danych która zawiera informacje o wirusach dzieki czemu umożliwia wykrycie złośliwego oprogramowania, odbywa się prawie każdego dnia i jest podstawą prawidłowego funkcjonowania programu antywirusowego. Bardzo często użytkownicy komputerów korzystają także z oprogramowania takiego jak:<br><br>    &nbspJava<br>    &nbspAdobe Acrobat Reader<br>    &nbspAdobe Flash Player<br><br>które także wymaga regularnych i dosyć częstych aktualizacji, których nie można zaniedbywać aby nie narażać się na niebezpieczeństwo oraz nieprawidłowe funkcjonowanie wspomnianych aplikacji.",
    "grafika": "./grafika/porady.jpg"
}